; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l10_p10_c10_g10_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 medicine)
	(has-content crate9 medicine)
	(has-content crate10 medicine)
	(at-person person1 loc6)
	(at-person person2 loc9)
	(at-person person3 loc8)
	(at-person person4 loc2)
	(at-person person5 loc5)
	(at-person person6 loc9)
	(at-person person7 loc5)
	(at-person person8 loc2)
	(at-person person9 loc9)
	(at-person person10 loc6)
)
(:goal (and
	(at-drone drone1 depot)
	(has person1 food)
	(has person2 food)
	(has person2 medicine)
	(has person4 food)
	(has person5 food)
	(has person6 food)
	(has person6 medicine)
	(has person8 food)
	(has person9 food)
	(has person9 medicine)
	))
)

; plan
1. (pickup-arm2 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm2 drone1) (available crate10)
   added: (carrying-arm2 drone1 crate10)
   goals met: 1 of 11
2. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 1 of 11
3. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 0 of 11
4. (deliver-arm1 drone1 crate7 person1 food loc6)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person1 food)
   goals met: 1 of 11
5. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 2 of 11
6. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 2 of 11
7. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 1 of 11
8. (deliver-arm1 drone1 crate6 person5 food loc5)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 2 of 11
9. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 3 of 11
10. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 3 of 11
11. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 2 of 11
12. (deliver-arm2 drone1 crate10 person2 medicine loc9)
   deleted: (carrying-arm2 drone1 crate10)
   added: (free-arm2 drone1) (has person2 medicine)
   goals met: 3 of 11
13. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 4 of 11
14. (pickup-arm2 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm2 drone1) (available crate9)
   added: (carrying-arm2 drone1 crate9)
   goals met: 4 of 11
15. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 3 of 11
16. (deliver-arm2 drone1 crate9 person6 medicine loc9)
   deleted: (carrying-arm2 drone1 crate9)
   added: (free-arm2 drone1) (has person6 medicine)
   goals met: 4 of 11
17. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 5 of 11
18. (pickup-arm2 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm2 drone1) (available crate8)
   added: (carrying-arm2 drone1 crate8)
   goals met: 5 of 11
19. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 4 of 11
20. (deliver-arm2 drone1 crate8 person9 medicine loc9)
   deleted: (carrying-arm2 drone1 crate8)
   added: (free-arm2 drone1) (has person9 medicine)
   goals met: 5 of 11
21. (deliver-arm1 drone1 crate5 person2 food loc9)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 6 of 11
22. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 7 of 11
23. (pickup-arm2 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm2 drone1) (available crate4)
   added: (carrying-arm2 drone1 crate4)
   goals met: 7 of 11
24. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 7 of 11
25. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 6 of 11
26. (deliver-arm2 drone1 crate4 person6 food loc9)
   deleted: (carrying-arm2 drone1 crate4)
   added: (free-arm2 drone1) (has person6 food)
   goals met: 7 of 11
27. (deliver-arm1 drone1 crate3 person9 food loc9)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person9 food)
   goals met: 8 of 11
28. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 9 of 11
29. (pickup-arm2 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm2 drone1) (available crate2)
   added: (carrying-arm2 drone1 crate2)
   goals met: 9 of 11
30. (pickup-arm1 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm1 drone1) (available crate1)
   added: (carrying-arm1 drone1 crate1)
   goals met: 9 of 11
31. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 8 of 11
32. (deliver-arm2 drone1 crate2 person4 food loc2)
   deleted: (carrying-arm2 drone1 crate2)
   added: (free-arm2 drone1) (has person4 food)
   goals met: 9 of 11
33. (deliver-arm1 drone1 crate1 person8 food loc2)
   deleted: (carrying-arm1 drone1 crate1)
   added: (free-arm1 drone1) (has person8 food)
   goals met: 10 of 11
34. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 11 of 11
